# 1.2 - Intro Pandas (Panel Data)

**[Documentación](https://pandas.pydata.org/docs/reference/index.html#api)**

**[Código fuente](https://github.com/pandas-dev/pandas)**


![pandas](images/pandas.png)


Pandas es una librería de python especializada en el manejo y análisis de estructuras de datos.


Las principales características de esta librería son:

+ Define nuevas estructuras de datos basadas en los arrays de la librería NumPy pero con nuevas funcionalidades.
+ Permite leer y escribir fácilmente ficheros en formato CSV, Excel y bases de datos SQL.
+ Permite acceder a los datos mediante índices o nombres para filas y columnas.
+ Ofrece métodos para reordenar, dividir y combinar conjuntos de datos.
+ Permite trabajar con series temporales.
+ Realiza todas estas operaciones de manera muy eficiente.


**Tipos de datos de Pandas**
Pandas dispone de dos estructuras de datos diferentes:

+ Series: Estructura de una dimensión.
+ DataFrame: Estructura de dos dimensiones (tablas).

Estas estructuras se construyen a partir de arrays de la librería NumPy, añadiendo nuevas funcionalidades.

In [ ]:
%pip install pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import warnings
warnings.filterwarnings('ignore')

### Serie

Son estructuras similares a los arrays de una dimensión. Son homogéneas, es decir, sus elementos tienen que ser del mismo tipo, y su tamaño es inmutable, es decir, no se puede cambiar, aunque si su contenido.

Dispone de un índice que asocia un nombre a cada elemento del la serie, a través de la cuál se accede al elemento.

In [4]:
lst = [(3.4 + i)**2 for i in range(10)]

lst

[11.559999999999999,
 19.360000000000003,
 29.160000000000004,
 40.96000000000001,
 54.760000000000005,
 70.56,
 88.36000000000001,
 108.16000000000001,
 129.96,
 153.76000000000002]

In [5]:
lst.append('hola')

In [6]:
serie = pd.Series(lst)

serie

0      11.56
1      19.36
2      29.16
3      40.96
4      54.76
5      70.56
6      88.36
7     108.16
8     129.96
9     153.76
10      hola
dtype: object

In [8]:
type(serie[2])

float

In [9]:
serie[10]

'hola'

In [10]:
type(serie[10])

str

In [11]:
serie[10] = 0.5

serie

0      11.56
1      19.36
2      29.16
3      40.96
4      54.76
5      70.56
6      88.36
7     108.16
8     129.96
9     153.76
10       0.5
dtype: object

In [13]:
#help(serie)

In [15]:
serie.head()   # la cabeza, 5 primeros por defecto

0    11.56
1    19.36
2    29.16
3    40.96
4    54.76
dtype: object

In [16]:
serie.head(2)

0    11.56
1    19.36
dtype: object

In [18]:
serie.tail()

6      88.36
7     108.16
8     129.96
9     153.76
10       0.5
dtype: object

In [19]:
serie.index

RangeIndex(start=0, stop=11, step=1)

In [20]:
serie.shape

(11,)

In [21]:
serie.index = ['q', 't', 'y', 'o', 'p', 'a', 's', 'd', 'f', 'g', 'v']

serie

q     11.56
t     19.36
y     29.16
o     40.96
p     54.76
a     70.56
s     88.36
d    108.16
f    129.96
g    153.76
v       0.5
dtype: object

In [22]:
serie[0]

11.559999999999999

In [23]:
serie['q']

11.559999999999999

In [24]:
serie.to_dict()

{'q': 11.559999999999999,
 't': 19.360000000000003,
 'y': 29.160000000000004,
 'o': 40.96000000000001,
 'p': 54.760000000000005,
 'a': 70.56,
 's': 88.36000000000001,
 'd': 108.16000000000001,
 'f': 129.96,
 'g': 153.76000000000002,
 'v': 0.5}

In [25]:
serie.to_frame()

        0
q   11.56
t   19.36
y   29.16
o   40.96
p   54.76
a   70.56
s   88.36
d  108.16
f  129.96
g  153.76
v     0.5

In [26]:
serie.to_frame().shape

(11, 1)

### DataFrame

Un objeto del tipo DataFrame define un conjunto de datos estructurado en forma de tabla donde cada columna es un objeto de tipo Series, es decir, todos los datos de una misma columna son del mismo tipo, y las filas son registros que pueden contender datos de distintos tipos.

Un DataFrame contiene dos índices, uno para las filas y otro para las columnas, y se puede acceder a sus elementos mediante los nombres de las filas y las columnas.

In [32]:
array = np.random.random((10, 5))

array

array([[0.76841661, 0.5210976 , 0.99801169, 0.87878694, 0.39953966],
       [0.68100675, 0.05241524, 0.87710617, 0.2420827 , 0.35393804],
       [0.59190573, 0.45543022, 0.66016771, 0.65420898, 0.20357844],
       [0.82343989, 0.81810619, 0.92808416, 0.22021984, 0.56424284],
       [0.32269519, 0.00849643, 0.22171641, 0.77834749, 0.92820212],
       [0.78573931, 0.65970577, 0.81683549, 0.55700327, 0.50491333],
       [0.80608403, 0.76507779, 0.35459278, 0.95902692, 0.08119747],
       [0.85240092, 0.50308484, 0.16609537, 0.63904527, 0.74828918],
       [0.2837545 , 0.58056959, 0.7036929 , 0.67566721, 0.01395755],
       [0.26074347, 0.45185875, 0.18231107, 0.65698003, 0.82416584]])

In [40]:
columnas = ['col1', 'col2', 'col 3', 'col4', 'col5']

In [41]:
df = pd.DataFrame(array, columns=columnas)

display(df)

       col1      col2     col 3      col4      col5
0  0.768417  0.521098  0.998012  0.878787  0.399540
1  0.681007  0.052415  0.877106  0.242083  0.353938
2  0.591906  0.455430  0.660168  0.654209  0.203578
3  0.823440  0.818106  0.928084  0.220220  0.564243
4  0.322695  0.008496  0.221716  0.778347  0.928202
5  0.785739  0.659706  0.816835  0.557003  0.504913
6  0.806084  0.765078  0.354593  0.959027  0.081197
7  0.852401  0.503085  0.166095  0.639045  0.748289
8  0.283755  0.580570  0.703693  0.675667  0.013958
9  0.260743  0.451859  0.182311  0.656980  0.824166

In [43]:
df['col 3']

0    0.998012
1    0.877106
2    0.660168
3    0.928084
4    0.221716
5    0.816835
6    0.354593
7    0.166095
8    0.703693
9    0.182311
Name: col 3, dtype: float64

In [44]:
df.col 3

SyntaxError: invalid syntax (3887910251.py, line 1)

In [46]:
df.columns = [e.lower().replace(' ', '_') for e in df.columns]

df.columns

Index(['col1', 'col2', 'col_3', 'col4', 'col5'], dtype='object')

In [47]:
df.col_3

0    0.998012
1    0.877106
2    0.660168
3    0.928084
4    0.221716
5    0.816835
6    0.354593
7    0.166095
8    0.703693
9    0.182311
Name: col_3, dtype: float64

In [48]:
df.col1

0    0.768417
1    0.681007
2    0.591906
3    0.823440
4    0.322695
5    0.785739
6    0.806084
7    0.852401
8    0.283755
9    0.260743
Name: col1, dtype: float64

In [49]:
seleccion = ['col4', 'col1']

seleccion

['col4', 'col1']

In [50]:
df[seleccion]

       col4      col1
0  0.878787  0.768417
1  0.242083  0.681007
2  0.654209  0.591906
3  0.220220  0.823440
4  0.778347  0.322695
5  0.557003  0.785739
6  0.959027  0.806084
7  0.639045  0.852401
8  0.675667  0.283755
9  0.656980  0.260743

In [51]:
df[['col4', 'col1']]

       col4      col1
0  0.878787  0.768417
1  0.242083  0.681007
2  0.654209  0.591906
3  0.220220  0.823440
4  0.778347  0.322695
5  0.557003  0.785739
6  0.959027  0.806084
7  0.639045  0.852401
8  0.675667  0.283755
9  0.656980  0.260743

In [54]:
df.rename(columns={'col_3': 'nueva_col'},    #{'key - la vieja': 'value - la nueva'}
          inplace=True)

In [55]:
df

       col1      col2  nueva_col      col4      col5
0  0.768417  0.521098   0.998012  0.878787  0.399540
1  0.681007  0.052415   0.877106  0.242083  0.353938
2  0.591906  0.455430   0.660168  0.654209  0.203578
3  0.823440  0.818106   0.928084  0.220220  0.564243
4  0.322695  0.008496   0.221716  0.778347  0.928202
5  0.785739  0.659706   0.816835  0.557003  0.504913
6  0.806084  0.765078   0.354593  0.959027  0.081197
7  0.852401  0.503085   0.166095  0.639045  0.748289
8  0.283755  0.580570   0.703693  0.675667  0.013958
9  0.260743  0.451859   0.182311  0.656980  0.824166

In [58]:
df['ceros'] = 0.

df

       col1      col2  nueva_col      col4      col5  ceros
0  0.768417  0.521098   0.998012  0.878787  0.399540    0.0
1  0.681007  0.052415   0.877106  0.242083  0.353938    0.0
2  0.591906  0.455430   0.660168  0.654209  0.203578    0.0
3  0.823440  0.818106   0.928084  0.220220  0.564243    0.0
4  0.322695  0.008496   0.221716  0.778347  0.928202    0.0
5  0.785739  0.659706   0.816835  0.557003  0.504913    0.0
6  0.806084  0.765078   0.354593  0.959027  0.081197    0.0
7  0.852401  0.503085   0.166095  0.639045  0.748289    0.0
8  0.283755  0.580570   0.703693  0.675667  0.013958    0.0
9  0.260743  0.451859   0.182311  0.656980  0.824166    0.0

In [61]:
df['ceros'][0]

0.0

In [62]:
df.insert(0, 'nueva_cero', [i for i in range(10)]) # inserta en la primera posicion

In [63]:
df

   nueva_cero      col1      col2  nueva_col      col4      col5  ceros
0           0  0.768417  0.521098   0.998012  0.878787  0.399540    0.0
1           1  0.681007  0.052415   0.877106  0.242083  0.353938    0.0
2           2  0.591906  0.455430   0.660168  0.654209  0.203578    0.0
3           3  0.823440  0.818106   0.928084  0.220220  0.564243    0.0
4           4  0.322695  0.008496   0.221716  0.778347  0.928202    0.0
5           5  0.785739  0.659706   0.816835  0.557003  0.504913    0.0
6           6  0.806084  0.765078   0.354593  0.959027  0.081197    0.0
7           7  0.852401  0.503085   0.166095  0.639045  0.748289    0.0
8           8  0.283755  0.580570   0.703693  0.675667  0.013958    0.0
9           9  0.260743  0.451859   0.182311  0.656980  0.824166    0.0

In [66]:
df['nulos'] = np.nan

df

   nueva_cero      col1      col2  nueva_col      col4      col5  ceros  nulos
0           0  0.768417  0.521098   0.998012  0.878787  0.399540    0.0    NaN
1           1  0.681007  0.052415   0.877106  0.242083  0.353938    0.0    NaN
2           2  0.591906  0.455430   0.660168  0.654209  0.203578    0.0    NaN
3           3  0.823440  0.818106   0.928084  0.220220  0.564243    0.0    NaN
4           4  0.322695  0.008496   0.221716  0.778347  0.928202    0.0    NaN
5           5  0.785739  0.659706   0.816835  0.557003  0.504913    0.0    NaN
6           6  0.806084  0.765078   0.354593  0.959027  0.081197    0.0    NaN
7           7  0.852401  0.503085   0.166095  0.639045  0.748289    0.0    NaN
8           8  0.283755  0.580570   0.703693  0.675667  0.013958    0.0    NaN
9           9  0.260743  0.451859   0.182311  0.656980  0.824166    0.0    NaN

In [67]:
df.shape

(10, 8)

In [68]:
df.size

80

In [69]:
len(df)   # filas

10

In [72]:
df.shape[0]

10

In [73]:
df['col10'] = df.col1 * df.col4 / df.col2

df

,nueva_cero,col1,col2,nueva_col,col4,col5,ceros,nulos,col10
0,0,0.768417,0.521098,0.998012,0.878787,0.399540,0.0,NaN,1.295870
1,1,0.681007,0.052415,0.877106,0.242083,0.353938,0.0,NaN,3.145267
2,2,0.591906,0.455430,0.660168,0.654209,0.203578,0.0,NaN,0.850251
3,3,0.823440,0.818106,0.928084,0.220220,0.564243,0.0,NaN,0.221656
4,4,0.322695,0.008496,0.221716,0.778347,0.928202,0.0,NaN,29.561715
5,5,0.785739,0.659706,0.816835,0.557003,0.504913,0.0,NaN,0.663416
6,6,0.806084,0.765078,0.354593,0.959027,0.081197,0.0,NaN,1.010428
7,7,0.852401,0.503085,0.166095,0.639045,0.748289,0.0,NaN,1.082765
8,8,0.283755,0.580570,0.703693,0.675667,0.013958,0.0,NaN,0.330234
9,9,0.260743,0.451859,0.182311,0.656980,0.824166,0.0,NaN,0.379108

In [79]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
nueva_cero,10.0,4.500000,3.027650,0.000000,2.250000,4.500000,6.750000,9.000000
col1,10.0,0.617619,0.239094,0.260743,0.389998,0.724712,0.800998,0.852401
col2,10.0,0.481584,0.268065,0.008496,0.452752,0.512091,0.639922,0.818106
nueva_col,10.0,0.590861,0.328203,0.166095,0.254935,0.681930,0.862038,0.998012
col4,10.0,0.626137,0.240190,0.220220,0.577514,0.655595,0.752677,0.959027
col5,10.0,0.462202,0.311069,0.013958,0.241168,0.452226,0.702278,0.928202
ceros,10.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
nulos,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
col10,10.0,3.854071,9.071241,0.221656,0.450185,0.930340,1.242593,29.561715

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nueva_cero  10 non-null     int64
 1   col1        10 non-null     float64
 2   col2        10 non-null     float64
 3   nueva_col   10 non-null     float64
 4   col4        10 non-null     float64
 5   col5        10 non-null     float64
 6   ceros       10 non-null     float64
 7   nulos       0 non-null      float64
 8   col10       10 non-null     float64
dtypes: float64(8), int64(1)
memory usage: 848.0 bytes

In [84]:
df.fillna('hola', inplace=True)   # sobreescribe con inplace=True

In [86]:
df.col1 = df.col1.fillna(0)       # sobreescribe con igualacion

In [87]:
df

,nueva_cero,col1,col2,nueva_col,col4,col5,ceros,nulos,col10
0,0,0.768417,0.521098,0.998012,0.878787,0.399540,0.0,hola,1.295870
1,1,0.681007,0.052415,0.877106,0.242083,0.353938,0.0,hola,3.145267
2,2,0.591906,0.455430,0.660168,0.654209,0.203578,0.0,hola,0.850251
3,3,0.823440,0.818106,0.928084,0.220220,0.564243,0.0,hola,0.221656
4,4,0.322695,0.008496,0.221716,0.778347,0.928202,0.0,hola,29.561715
5,5,0.785739,0.659706,0.816835,0.557003,0.504913,0.0,hola,0.663416
6,6,0.806084,0.765078,0.354593,0.959027,0.081197,0.0,hola,1.010428
7,7,0.852401,0.503085,0.166095,0.639045,0.748289,0.0,hola,1.082765
8,8,0.283755,0.580570,0.703693,0.675667,0.013958,0.0,hola,0.330234
9,9,0.260743,0.451859,0.182311,0.656980,0.824166,0.0,hola,0.379108

In [88]:
# introducir datos desde una lista de listas

lst_lst=[[687261, 'hola', 4728364], 
         [83546, 'adios', 58943], 
         [321, 'oo^oo']]


columnas=['num', 'palabra', 'otro_num']

In [89]:
df_lst = pd.DataFrame(lst_lst, columns=columnas)

df_lst

      num palabra   otro_num
0  687261    hola  4728364.0
1   83546   adios    58943.0
2     321   oo^oo        NaN

In [90]:
df_lst['num']

0    687261
1     83546
2       321
Name: num, dtype: int64

In [92]:
df_lst['otro_num'].fillna(0, inplace=True)

In [93]:
df_lst

      num palabra   otro_num
0  687261    hola  4728364.0
1   83546   adios    58943.0
2     321   oo^oo        0.0

In [94]:
# con dictio

dictio={'casa': lst_lst[0],
        'oficina': lst_lst[1],
        'numero': lst_lst[2]+[0]}

dictio

{'casa': [687261, 'hola', 4728364],
 'oficina': [83546, 'adios', 58943],
 'numero': [321, 'oo^oo', 0]}

In [95]:
df_dictio = pd.DataFrame(dictio)

df_dictio

      casa oficina numero
0   687261   83546    321
1     hola   adios  oo^oo
2  4728364   58943      0

In [96]:
df.drop(columns=['col1', 'col2'], inplace=True)

In [98]:
df.drop(0, axis=0, inplace=True)  # fila 0, eje 0 (por filas)

In [100]:
df.drop(8, axis=0, inplace=True)  # fila8, eje 0 (por filas)

In [101]:
df

   nueva_cero  nueva_col      col4      col5  ceros nulos      col10
1           1   0.877106  0.242083  0.353938    0.0  hola   3.145267
2           2   0.660168  0.654209  0.203578    0.0  hola   0.850251
3           3   0.928084  0.220220  0.564243    0.0  hola   0.221656
4           4   0.221716  0.778347  0.928202    0.0  hola  29.561715
5           5   0.816835  0.557003  0.504913    0.0  hola   0.663416
6           6   0.354593  0.959027  0.081197    0.0  hola   1.010428
7           7   0.166095  0.639045  0.748289    0.0  hola   1.082765
9           9   0.182311  0.656980  0.824166    0.0  hola   0.379108

In [102]:
df.drop(index=[5, 6, 7], inplace=True)

In [104]:
df.reset_index()

   index  nueva_cero  nueva_col      col4      col5  ceros nulos      col10
0      1           1   0.877106  0.242083  0.353938    0.0  hola   3.145267
1      2           2   0.660168  0.654209  0.203578    0.0  hola   0.850251
2      3           3   0.928084  0.220220  0.564243    0.0  hola   0.221656
3      4           4   0.221716  0.778347  0.928202    0.0  hola  29.561715
4      9           9   0.182311  0.656980  0.824166    0.0  hola   0.379108

In [105]:
df.reset_index(drop=True)

   nueva_cero  nueva_col      col4      col5  ceros nulos      col10
0           1   0.877106  0.242083  0.353938    0.0  hola   3.145267
1           2   0.660168  0.654209  0.203578    0.0  hola   0.850251
2           3   0.928084  0.220220  0.564243    0.0  hola   0.221656
3           4   0.221716  0.778347  0.928202    0.0  hola  29.561715
4           9   0.182311  0.656980  0.824166    0.0  hola   0.379108

In [112]:
df.index = [i for i in range(df.shape[0])]

df

   nueva_cero  nueva_col      col4      col5  ceros nulos      col10
0           1   0.877106  0.242083  0.353938    0.0  hola   3.145267
1           2   0.660168  0.654209  0.203578    0.0  hola   0.850251
2           3   0.928084  0.220220  0.564243    0.0  hola   0.221656
3           4   0.221716  0.778347  0.928202    0.0  hola  29.561715
4           9   0.182311  0.656980  0.824166    0.0  hola   0.379108

### Operaciones

In [113]:
df

   nueva_cero  nueva_col      col4      col5  ceros nulos      col10
0           1   0.877106  0.242083  0.353938    0.0  hola   3.145267
1           2   0.660168  0.654209  0.203578    0.0  hola   0.850251
2           3   0.928084  0.220220  0.564243    0.0  hola   0.221656
3           4   0.221716  0.778347  0.928202    0.0  hola  29.561715
4           9   0.182311  0.656980  0.824166    0.0  hola   0.379108

In [114]:
df.transpose()

                   0         1         2          3         4
nueva_cero         1         2         3          4         9
nueva_col   0.877106  0.660168  0.928084   0.221716  0.182311
col4        0.242083  0.654209   0.22022   0.778347   0.65698
col5        0.353938  0.203578  0.564243   0.928202  0.824166
ceros            0.0       0.0       0.0        0.0       0.0
nulos           hola      hola      hola       hola      hola
col10       3.145267  0.850251  0.221656  29.561715  0.379108

In [115]:
df.T

                   0         1         2          3         4
nueva_cero         1         2         3          4         9
nueva_col   0.877106  0.660168  0.928084   0.221716  0.182311
col4        0.242083  0.654209   0.22022   0.778347   0.65698
col5        0.353938  0.203578  0.564243   0.928202  0.824166
ceros            0.0       0.0       0.0        0.0       0.0
nulos           hola      hola      hola       hola      hola
col10       3.145267  0.850251  0.221656  29.561715  0.379108

In [116]:
df.T.index

Index(['nueva_cero', 'nueva_col', 'col4', 'col5', 'ceros', 'nulos', 'col10'], dtype='object')

In [117]:
df.columns

Index(['nueva_cero', 'nueva_col', 'col4', 'col5', 'ceros', 'nulos', 'col10'], dtype='object')

In [123]:
df.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [119]:
df.sum()

nueva_cero                      19
nueva_col                 2.869386
col4                      2.551839
col5                      2.874127
ceros                          0.0
nulos         holaholaholaholahola
col10                    34.157997
dtype: object

In [124]:
df.sum(axis=0)

nueva_cero                      19
nueva_col                 2.869386
col4                      2.551839
col5                      2.874127
ceros                          0.0
nulos         holaholaholaholahola
col10                    34.157997
dtype: object

In [125]:
df.sum(axis=1)

0     5.618394
1     4.368206
2     4.934202
3    35.489981
4    11.042565
dtype: float64

In [128]:
seleccion=['col4', 'col5', 'col10']

df[seleccion].sum()

col4      2.551839
col5      2.874127
col10    34.157997
dtype: float64

In [129]:
df.std()

nueva_cero     3.114482
nueva_col      0.354330
col4           0.259885
col5           0.305685
ceros          0.000000
col10         12.760777
dtype: float64

In [130]:
df.var()

nueva_cero      9.700000
nueva_col       0.125549
col4            0.067540
col5            0.093443
ceros           0.000000
col10         162.837431
dtype: float64

In [131]:
df.mean()

nueva_cero    3.800000
nueva_col     0.573877
col4          0.510368
col5          0.574825
ceros         0.000000
col10         6.831599
dtype: float64

In [132]:
df.median()

nueva_cero    3.000000
nueva_col     0.660168
col4          0.654209
col5          0.564243
ceros         0.000000
col10         0.850251
dtype: float64

In [133]:
df.mode()

   nueva_cero  nueva_col      col4      col5  ceros nulos      col10
0           1   0.182311  0.220220  0.203578    0.0  hola   0.221656
1           2   0.221716  0.242083  0.353938    NaN   NaN   0.379108
2           3   0.660168  0.654209  0.564243    NaN   NaN   0.850251
3           4   0.877106  0.656980  0.824166    NaN   NaN   3.145267
4           9   0.928084  0.778347  0.928202    NaN   NaN  29.561715

### Importar archivos

+ CSV
+ XLSX
+ XLS
+ JSON

In [135]:
pd.set_option('display.max_columns', None)  # ver todas las columnas

pd.set_option('display.max_rows', None)     # ver todas las filas

In [136]:
#csv

ruta = '../data/vehicles.csv'    # r'..\data\vehicles.csv'

df_csv = pd.read_csv(ruta)

df_csv.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [137]:
df_csv.shape

(35952, 15)

In [144]:
df_csv.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35952 entries, 0 to 35951
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Make                     35952 non-null  object
 1   Model                    35952 non-null  object
 2   Year                     35952 non-null  int64
 3   Engine Displacement      35952 non-null  float64
 4   Cylinders                35952 non-null  float64
 5   Transmission             35952 non-null  object
 6   Drivetrain               35952 non-null  object
 7   Vehicle Class            35952 non-null  object
 8   Fuel Type                35952 non-null  object
 9   Fuel Barrels/Year        35952 non-null  float64
 10  City MPG                 35952 non-null  int64
 11  Highway MPG              35952 non-null  int64
 12  Combined MPG             35952 non-null  int64
 13  CO2 Emission Grams/Mile  35952 non-null  float64
 14  Fuel Cost/Year           35952 non-null  int64
dtypes: float64(4), int64(5), object(6)
memory usage: 16.8 MB

In [ ]:
%pip install openpyxl
%pip install xlrd

In [145]:
# xlsx

df_xlsx = pd.read_excel('../data/Online Retail.xlsx')

df_xlsx.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [146]:
df_xlsx.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    396034 non-null  int64
 1   InvoiceDate  396034 non-null  datetime64[ns]
 2   StockCode    396034 non-null  object
 3   Description  396034 non-null  object
 4   Quantity     396034 non-null  int64
 5   UnitPrice    396034 non-null  float64
 6   Revenue      396034 non-null  float64
 7   CustomerID   396034 non-null  int64
 8   Country      396034 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(3), object(3)
memory usage: 90.7 MB

In [147]:
# xls

df_xls=pd.read_excel('../data/Sensor Data.xls')

df_xls.head()

,Input 1,Input 2,Input 3,Input 4,Input 5,Input 6,Input 7,Input 8,Input 9,Input 10,Input 11,Input 12,output1,output2,class
0,1.473,2.311,3.179,2.666,0.2795,0.2771,0.22340,0.1855,0.2539,1.138,1.111,4.712,1,1,one
1,1.460,2.377,3.214,2.920,0.2527,0.3064,0.02563,0.1965,0.3027,1.213,1.027,5.463,1,1,one
2,1.552,2.164,3.064,2.745,0.2820,0.2100,0.17210,0.1929,0.2100,1.221,1.058,5.332,1,1,one
3,1.605,2.228,3.149,2.834,0.2917,0.3613,0.20870,0.1294,0.2734,1.144,1.062,4.829,1,1,one
4,1.534,2.114,3.309,2.976,0.2100,0.2502,0.22580,0.1770,0.2039,1.254,1.112,5.734,1,1,one

In [148]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 'Sheet1')

df_xls.head()

,Input 1,Input 2,Input 3,Input 4,Input 5,Input 6,Input 7,Input 8,Input 9,Input 10,Input 11,Input 12,output1,output2,class
0,1.473,2.311,3.179,2.666,0.2795,0.2771,0.22340,0.1855,0.2539,1.138,1.111,4.712,1,1,one
1,1.460,2.377,3.214,2.920,0.2527,0.3064,0.02563,0.1965,0.3027,1.213,1.027,5.463,1,1,one
2,1.552,2.164,3.064,2.745,0.2820,0.2100,0.17210,0.1929,0.2100,1.221,1.058,5.332,1,1,one
3,1.605,2.228,3.149,2.834,0.2917,0.3613,0.20870,0.1294,0.2734,1.144,1.062,4.829,1,1,one
4,1.534,2.114,3.309,2.976,0.2100,0.2502,0.22580,0.1770,0.2039,1.254,1.112,5.734,1,1,one

In [149]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 'Sheet2')

df_xls.head()

                                                    Sensor Data
0  The data source as well as the exact nature of...
1  Each data instance contains 12 real-valued inp...
2  represents a sensor designed to detect the pre...
3  of substances. As an alternative, the sensor r...
4                                                NaN

In [150]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 'Sheet3')

df_xls.head()

Empty DataFrame
Columns: [hola, amiguis, estamos, probando, pandas]
Index: []

In [151]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 'Hoja1')

df_xls.head()

    32  42  4q34q34
0  23r   4      NaN
1  NaN  42      NaN

In [152]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 0)

df_xls.head()

,Input 1,Input 2,Input 3,Input 4,Input 5,Input 6,Input 7,Input 8,Input 9,Input 10,Input 11,Input 12,output1,output2,class
0,1.473,2.311,3.179,2.666,0.2795,0.2771,0.22340,0.1855,0.2539,1.138,1.111,4.712,1,1,one
1,1.460,2.377,3.214,2.920,0.2527,0.3064,0.02563,0.1965,0.3027,1.213,1.027,5.463,1,1,one
2,1.552,2.164,3.064,2.745,0.2820,0.2100,0.17210,0.1929,0.2100,1.221,1.058,5.332,1,1,one
3,1.605,2.228,3.149,2.834,0.2917,0.3613,0.20870,0.1294,0.2734,1.144,1.062,4.829,1,1,one
4,1.534,2.114,3.309,2.976,0.2100,0.2502,0.22580,0.1770,0.2039,1.254,1.112,5.734,1,1,one

In [153]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 1)

df_xls.head()

                                                    Sensor Data
0  The data source as well as the exact nature of...
1  Each data instance contains 12 real-valued inp...
2  represents a sensor designed to detect the pre...
3  of substances. As an alternative, the sensor r...
4                                                NaN

In [154]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 2)

df_xls.head()

Empty DataFrame
Columns: [hola, amiguis, estamos, probando, pandas]
Index: []

In [155]:
df_xls=pd.read_excel('../data/Sensor Data.xls', 3)

df_xls.head()

    32  42  4q34q34
0  23r   4      NaN
1  NaN  42      NaN

In [156]:
xls = pd.ExcelFile('../data/Sensor Data.xls')

xls.sheet_names

['Sheet1', 'Sheet2', 'Sheet3', 'Hoja1']

In [157]:
xls

In [158]:
dictio_df = {}

for hoja in xls.sheet_names:
    
    dictio_df[hoja] = pd.read_excel('../data/Sensor Data.xls', hoja)

In [160]:
dictio_df['Hoja1']

    32  42  4q34q34
0  23r   4      NaN
1  NaN  42      NaN

In [162]:
dictio_df['Sheet1'].shape

(2212, 15)

In [163]:
f'a_{1}' = 0

SyntaxError: cannot assign to f-string expression (4130609188.py, line 1)

In [167]:
dictio_df.keys()

dict_keys(['Sheet1', 'Sheet2', 'Sheet3', 'Hoja1'])

In [168]:
# json

df_json = pd.read_json('../data/oficinas.json')

df_json.head()

,name,totalOffices,lat,lng,principal
0,Wetpaint,2,47.603122,-122.333253,"{'type': 'Point', 'coordinates': [-122.333253,..."
1,AdventNet,1,37.692934,-121.904945,"{'type': 'Point', 'coordinates': [-121.904945,..."
2,Zoho,1,37.692934,-121.904945,"{'type': 'Point', 'coordinates': [-121.904945,..."
3,Digg,1,37.764726,-122.394523,"{'type': 'Point', 'coordinates': [-122.394523,..."
4,Facebook,3,37.416050,-122.151801,"{'type': 'Point', 'coordinates': [-122.151801,..."

In [169]:
df_json.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9618 entries, 0 to 13743
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          9618 non-null   object
 1   totalOffices  9618 non-null   int64
 2   lat           9618 non-null   float64
 3   lng           9618 non-null   float64
 4   principal     9618 non-null   object
dtypes: float64(2), int64(1), object(2)
memory usage: 450.8+ KB

In [171]:
df_json['principal'][0]

{'type': 'Point', 'coordinates': [-122.333253, 47.603122]}